Revit 2024 API
FaceArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual FaceArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As FaceArrayIterator
Visual C++
public:
virtual FaceArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
FaceArray Class
Autodesk.Revit.DB Namespace